hengyingchou/Embedded-system/Lab4/Lab42/a/tm4c1294ncpdt_42a.h
//*****************************************************************************
//
// GPIO registers (PORTC AHB)
//
//*****************************************************************************
#define GPIO_PORTC_DATA_BITS_R  ((volatile uint32_t *)0x4005A000)
#define GPIO_PORTC_DATA_R       (*((volatile uint32_t *)0x4005A3FC))
#define GPIO_PORTC_DIR_R        (*((volatile uint32_t *)0x4005A400))
#define GPIO_PORTC_IS_R         (*((volatile uint32_t *)0x4005A404))
#define GPIO_PORTC_IBE_R        (*((volatile uint32_t *)0x4005A408))
#define GPIO_PORTC_IEV_R        (*((volatile uint32_t *)0x4005A40C))
#define GPIO_PORTC_IM_R         (*((volatile uint32_t *)0x4005A410))
#define GPIO_PORTC_RIS_R        (*((volatile uint32_t *)0x4005A414))
#define GPIO_PORTC_MIS_R        (*((volatile uint32_t *)0x4005A418))
#define GPIO_PORTC_ICR_R        (*((volatile uint32_t *)0x4005A41C))
#define GPIO_PORTC_AFSEL_R      (*((volatile uint32_t *)0x4005A420))
#define GPIO_PORTC_DR2R_R       (*((volatile uint32_t *)0x4005A500))
#define GPIO_PORTC_DR4R_R       (*((volatile uint32_t *)0x4005A504))
#define GPIO_PORTC_DR8R_R       (*((volatile uint32_t *)0x4005A508))
#define GPIO_PORTC_ODR_R        (*((volatile uint32_t *)0x4005A50C))
#define GPIO_PORTC_PUR_R        (*((volatile uint32_t *)0x4005A510))
#define GPIO_PORTC_PDR_R        (*((volatile uint32_t *)0x4005A514))
#define GPIO_PORTC_SLR_R        (*((volatile uint32_t *)0x4005A518))
#define GPIO_PORTC_DEN_R        (*((volatile uint32_t *)0x4005A51C))
#define GPIO_PORTC_LOCK_R       (*((volatile uint32_t *)0x4005A520))
#define GPIO_PORTC_CR_R         (*((volatile uint32_t *)0x4005A524))
#define GPIO_PORTC_AMSEL_R      (*((volatile uint32_t *)0x4005A528))
#define GPIO_PORTC_PCTL_R       (*((volatile uint32_t *)0x4005A52C))
#define GPIO_PORTC_ADCCTL_R     (*((volatile uint32_t *)0x4005A530))
#define GPIO_PORTC_DMACTL_R     (*((volatile uint32_t *)0x4005A534))
#define GPIO_PORTC_SI_R         (*((volatile uint32_t *)0x4005A538))
#define GPIO_PORTC_DR12R_R      (*((volatile uint32_t *)0x4005A53C))
#define GPIO_PORTC_WAKEPEN_R    (*((volatile uint32_t *)0x4005A540))
#define GPIO_PORTC_WAKELVL_R    (*((volatile uint32_t *)0x4005A544))
#define GPIO_PORTC_WAKESTAT_R   (*((volatile uint32_t *)0x4005A548))
#define GPIO_PORTC_PP_R         (*((volatile uint32_t *)0x4005AFC0))
#define GPIO_PORTC_PC_R         (*((volatile uint32_t *)0x4005AFC4))

//*****************************************************************************
//
// GPIO registers (PORTD AHB)
//
//*****************************************************************************
#define GPIO_PORTD_DATA_BITS_R  ((volatile uint32_t *)0x4005B000)
#define GPIO_PORTD_DATA_R       (*((volatile uint32_t *)0x4005B3FC))
#define GPIO_PORTD_DIR_R        (*((volatile uint32_t *)0x4005B400))
#define GPIO_PORTD_IS_R         (*((volatile uint32_t *)0x4005B404))
#define GPIO_PORTD_IBE_R        (*((volatile uint32_t *)0x4005B408))
#define GPIO_PORTD_IEV_R        (*((volatile uint32_t *)0x4005B40C))
#define GPIO_PORTD_IM_R         (*((volatile uint32_t *)0x4005B410))
#define GPIO_PORTD_RIS_R        (*((volatile uint32_t *)0x4005B414))
#define GPIO_PORTD_MIS_R        (*((volatile uint32_t *)0x4005B418))
#define GPIO_PORTD_ICR_R        (*((volatile uint32_t *)0x4005B41C))
#define GPIO_PORTD_AFSEL_R      (*((volatile uint32_t *)0x4005B420))
#define GPIO_PORTD_DR2R_R       (*((volatile uint32_t *)0x4005B500))
#define GPIO_PORTD_DR4R_R       (*((volatile uint32_t *)0x4005B504))
#define GPIO_PORTD_DR8R_R       (*((volatile uint32_t *)0x4005B508))
#define GPIO_PORTD_ODR_R        (*((volatile uint32_t *)0x4005B50C))
#define GPIO_PORTD_PUR_R        (*((volatile uint32_t *)0x4005B510))
#define GPIO_PORTD_PDR_R        (*((volatile uint32_t *)0x4005B514))
#define GPIO_PORTD_SLR_R        (*((volatile uint32_t *)0x4005B518))
#define GPIO_PORTD_DEN_R        (*((volatile uint32_t *)0x4005B51C))
#define GPIO_PORTD_LOCK_R       (*((volatile uint32_t *)0x4005B520))
#define GPIO_PORTD_CR_R         (*((volatile uint32_t *)0x4005B524))
#define GPIO_PORTD_AMSEL_R      (*((volatile uint32_t *)0x4005B528))
#define GPIO_PORTD_PCTL_R       (*((volatile uint32_t *)0x4005B52C))
#define GPIO_PORTD_ADCCTL_R     (*((volatile uint32_t *)0x4005B530))
#define GPIO_PORTD_DMACTL_R     (*((volatile uint32_t *)0x4005B534))
#define GPIO_PORTD_SI_R         (*((volatile uint32_t *)0x4005B538))
#define GPIO_PORTD_DR12R_R      (*((volatile uint32_t *)0x4005B53C))
#define GPIO_PORTD_WAKEPEN_R    (*((volatile uint32_t *)0x4005B540))
#define GPIO_PORTD_WAKELVL_R    (*((volatile uint32_t *)0x4005B544))
#define GPIO_PORTD_WAKESTAT_R   (*((volatile uint32_t *)0x4005B548))
#define GPIO_PORTD_PP_R         (*((volatile uint32_t *)0x4005BFC0))
#define GPIO_PORTD_PC_R         (*((volatile uint32_t *)0x4005BFC4))

//*****************************************************************************
//
// GPIO registers (PORTE AHB)
//
//*****************************************************************************
#define GPIO_PORTE_DATA_BITS_R  ((volatile uint32_t *)0x4005C000)
#define GPIO_PORTE_DATA_R       (*((volatile uint32_t *)0x4005C3FC))
#define GPIO_PORTE_DIR_R        (*((volatile uint32_t *)0x4005C400))
#define GPIO_PORTE_IS_R         (*((volatile uint32_t *)0x4005C404))
#define GPIO_PORTE_IBE_R        (*((volatile uint32_t *)0x4005C408))
#define GPIO_PORTE_IEV_R        (*((volatile uint32_t *)0x4005C40C))
#define GPIO_PORTE_IM_R         (*((volatile uint32_t *)0x4005C410))
#define GPIO_PORTE_RIS_R        (*((volatile uint32_t *)0x4005C414))
#define GPIO_PORTE_MIS_R        (*((volatile uint32_t *)0x4005C418))
#define GPIO_PORTE_ICR_R        (*((volatile uint32_t *)0x4005C41C))
#define GPIO_PORTE_AFSEL_R      (*((volatile uint32_t *)0x4005C420))
#define GPIO_PORTE_DR2R_R       (*((volatile uint32_t *)0x4005C500))
#define GPIO_PORTE_DR4R_R       (*((volatile uint32_t *)0x4005C504))
#define GPIO_PORTE_DR8R_R       (*((volatile uint32_t *)0x4005C508))
#define GPIO_PORTE_ODR_R        (*((volatile uint32_t *)0x4005C50C))
#define GPIO_PORTE_PUR_R        (*((volatile uint32_t *)0x4005C510))
#define GPIO_PORTE_PDR_R        (*((volatile uint32_t *)0x4005C514))
#define GPIO_PORTE_SLR_R        (*((volatile uint32_t *)0x4005C518))
#define GPIO_PORTE_DEN_R        (*((volatile uint32_t *)0x4005C51C))
#define GPIO_PORTE_LOCK_R       (*((volatile uint32_t *)0x4005C520))
#define GPIO_PORTE_CR_R         (*((volatile uint32_t *)0x4005C524))
#define GPIO_PORTE_AMSEL_R      (*((volatile uint32_t *)0x4005C528))
#define GPIO_PORTE_PCTL_R       (*((volatile uint32_t *)0x4005C52C))
#define GPIO_PORTE_ADCCTL_R     (*((volatile uint32_t *)0x4005C530))
#define GPIO_PORTE_DMACTL_R     (*((volatile uint32_t *)0x4005C534))
#define GPIO_PORTE_SI_R         (*((volatile uint32_t *)0x4005C538))
#define GPIO_PORTE_DR12R_R      (*((volatile uint32_t *)0x4005C53C))
#define GPIO_PORTE_WAKEPEN_R    (*((volatile uint32_t *)0x4005C540))
#define GPIO_PORTE_WAKELVL_R    (*((volatile uint32_t *)0x4005C544))
#define GPIO_PORTE_WAKESTAT_R   (*((volatile uint32_t *)0x4005C548))
#define GPIO_PORTE_PP_R         (*((volatile uint32_t *)0x4005CFC0))
#define GPIO_PORTE_PC_R         (*((volatile uint32_t *)0x4005CFC4))

//*****************************************************************************
//
// GPIO registers (PORTF AHB)
//
//*****************************************************************************
#define GPIO_PORTF_DATA_BITS_R  ((volatile uint32_t *)0x4005D000)
#define GPIO_PORTF_DATA_R       (*((volatile uint32_t *)0x4005D3FC))
#define GPIO_PORTF_DIR_R        (*((volatile uint32_t *)0x4005D400))
#define GPIO_PORTF_IS_R         (*((volatile uint32_t *)0x4005D404))
#define GPIO_PORTF_IBE_R        (*((volatile uint32_t *)0x4005D408))
#define GPIO_PORTF_IEV_R        (*((volatile uint32_t *)0x4005D40C))
#define GPIO_PORTF_IM_R         (*((volatile uint32_t *)0x4005D410))
#define GPIO_PORTF_RIS_R        (*((volatile uint32_t *)0x4005D414))
#define GPIO_PORTF_MIS_R        (*((volatile uint32_t *)0x4005D418))
#define GPIO_PORTF_ICR_R        (*((volatile uint32_t *)0x4005D41C))
#define GPIO_PORTF_AFSEL_R      (*((volatile uint32_t *)0x4005D420))
#define GPIO_PORTF_DR2R_R       (*((volatile uint32_t *)0x4005D500))
#define GPIO_PORTF_DR4R_R       (*((volatile uint32_t *)0x4005D504))
#define GPIO_PORTF_DR8R_R       (*((volatile uint32_t *)0x4005D508))
#define GPIO_PORTF_ODR_R        (*((volatile uint32_t *)0x4005D50C))
#define GPIO_PORTF_PUR_R        (*((volatile uint32_t *)0x4005D510))
#define GPIO_PORTF_PDR_R        (*((volatile uint32_t *)0x4005D514))
#define GPIO_PORTF_SLR_R        (*((volatile uint32_t *)0x4005D518))
#define GPIO_PORTF_DEN_R        (*((volatile uint32_t *)0x4005D51C))
#define GPIO_PORTF_LOCK_R       (*((volatile uint32_t *)0x4005D520))
#define GPIO_PORTF_CR_R         (*((volatile uint32_t *)0x4005D524))
#define GPIO_PORTF_AMSEL_R      (*((volatile uint32_t *)0x4005D528))
#define GPIO_PORTF_PCTL_R       (*((volatile uint32_t *)0x4005D52C))
#define GPIO_PORTF_ADCCTL_R     (*((volatile uint32_t *)0x4005D530))
#define GPIO_PORTF_DMACTL_R     (*((volatile uint32_t *)0x4005D534))
#define GPIO_PORTF_SI_R         (*((volatile uint32_t *)0x4005D538))
#define GPIO_PORTF_DR12R_R      (*((volatile uint32_t *)0x4005D53C))
#define GPIO_PORTF_WAKEPEN_R    (*((volatile uint32_t *)0x4005D540))
#define GPIO_PORTF_WAKELVL_R    (*((volatile uint32_t *)0x4005D544))
#define GPIO_PORTF_WAKESTAT_R   (*((volatile uint32_t *)0x4005D548))
#define GPIO_PORTF_PP_R         (*((volatile uint32_t *)0x4005DFC0))
#define GPIO_PORTF_PC_R         (*((volatile uint32_t *)0x4005DFC4))

//*****************************************************************************
//
// GPIO registers (PORTG AHB)
//
//*****************************************************************************
#define GPIO_PORTG_DATA_BITS_R  ((volatile uint32_t *)0x4005E000)
#define GPIO_PORTG_DATA_R       (*((volatile uint32_t *)0x4005E3FC))
#define GPIO_PORTG_DIR_R        (*((volatile uint32_t *)0x4005E400))
#define GPIO_PORTG_IS_R         (*((volatile uint32_t *)0x4005E404))
#define GPIO_PORTG_IBE_R        (*((volatile uint32_t *)0x4005E408))
#define GPIO_PORTG_IEV_R        (*((volatile uint32_t *)0x4005E40C))
#define GPIO_PORTG_IM_R         (*((volatile uint32_t *)0x4005E410))
#define GPIO_PORTG_RIS_R        (*((volatile uint32_t *)0x4005E414))
#define GPIO_PORTG_MIS_R        (*((volatile uint32_t *)0x4005E418))
#define GPIO_PORTG_ICR_R        (*((volatile uint32_t *)0x4005E41C))
#define GPIO_PORTG_AFSEL_R      (*((volatile uint32_t *)0x4005E420))
#define GPIO_PORTG_DR2R_R       (*((volatile uint32_t *)0x4005E500))
#define GPIO_PORTG_DR4R_R       (*((volatile uint32_t *)0x4005E504))
#define GPIO_PORTG_DR8R_R       (*((volatile uint32_t *)0x4005E508))
#define GPIO_PORTG_ODR_R        (*((volatile uint32_t *)0x4005E50C))
#define GPIO_PORTG_PUR_R        (*((volatile uint32_t *)0x4005E510))
#define GPIO_PORTG_PDR_R        (*((volatile uint32_t *)0x4005E514))
#define GPIO_PORTG_SLR_R        (*((volatile uint32_t *)0x4005E518))
#define GPIO_PORTG_DEN_R        (*((volatile uint32_t *)0x4005E51C))
#define GPIO_PORTG_LOCK_R       (*((volatile uint32_t *)0x4005E520))
#define GPIO_PORTG_CR_R         (*((volatile uint32_t *)0x4005E524))
#define GPIO_PORTG_AMSEL_R      (*((volatile uint32_t *)0x4005E528))
#define GPIO_PORTG_PCTL_R       (*((volatile uint32_t *)0x4005E52C))
#define GPIO_PORTG_ADCCTL_R     (*((volatile uint32_t *)0x4005E530))
#define GPIO_PORTG_DMACTL_R     (*((volatile uint32_t *)0x4005E534))
#define GPIO_PORTG_SI_R         (*((volatile uint32_t *)0x4005E538))
#define GPIO_PORTG_DR12R_R      (*((volatile uint32_t *)0x4005E53C))
#define GPIO_PORTG_WAKEPEN_R    (*((volatile uint32_t *)0x4005E540))
#define GPIO_PORTG_WAKELVL_R    (*((volatile uint32_t *)0x4005E544))
#define GPIO_PORTG_WAKESTAT_R   (*((volatile uint32_t *)0x4005E548))
#define GPIO_PORTG_PP_R         (*((volatile uint32_t *)0x4005EFC0))
#define GPIO_PORTG_PC_R         (*((volatile uint32_t *)0x4005EFC4))

//*****************************************************************************
//
// GPIO registers (PORTH AHB)
//
//*****************************************************************************
#define GPIO_PORTH_DATA_BITS_R  ((volatile uint32_t *)0x4005F000)
#define GPIO_PORTH_DATA_R       (*((volatile uint32_t *)0x4005F3FC))
#define GPIO_PORTH_DIR_R        (*((volatile uint32_t *)0x4005F400))
#define GPIO_PORTH_IS_R         (*((volatile uint32_t *)0x4005F404))
#define GPIO_PORTH_IBE_R        (*((volatile uint32_t *)0x4005F408))
#define GPIO_PORTH_IEV_R        (*((volatile uint32_t *)0x4005F40C))
#define GPIO_PORTH_IM_R         (*((volatile uint32_t *)0x4005F410))
#define GPIO_PORTH_RIS_R        (*((volatile uint32_t *)0x4005F414))
#define GPIO_PORTH_MIS_R        (*((volatile uint32_t *)0x4005F418))
#define GPIO_PORTH_ICR_R        (*((volatile uint32_t *)0x4005F41C))
#define GPIO_PORTH_AFSEL_R      (*((volatile uint32_t *)0x4005F420))
#define GPIO_PORTH_DR2R_R       (*((volatile uint32_t *)0x4005F500))
#define GPIO_PORTH_DR4R_R       (*((volatile uint32_t *)0x4005F504))
#define GPIO_PORTH_DR8R_R       (*((volatile uint32_t *)0x4005F508))
#define GPIO_PORTH_ODR_R        (*((volatile uint32_t *)0x4005F50C))
#define GPIO_PORTH_PUR_R        (*((volatile uint32_t *)0x4005F510))
#define GPIO_PORTH_PDR_R        (*((volatile uint32_t *)0x4005F514))
#define GPIO_PORTH_SLR_R        (*((volatile uint32_t *)0x4005F518))
#define GPIO_PORTH_DEN_R        (*((volatile uint32_t *)0x4005F51C))
#define GPIO_PORTH_LOCK_R       (*((volatile uint32_t *)0x4005F520))
#define GPIO_PORTH_CR_R         (*((volatile uint32_t *)0x4005F524))
#define GPIO_PORTH_AMSEL_R      (*((volatile uint32_t *)0x4005F528))
#define GPIO_PORTH_PCTL_R       (*((volatile uint32_t *)0x4005F52C))
#define GPIO_PORTH_ADCCTL_R     (*((volatile uint32_t *)0x4005F530))
#define GPIO_PORTH_DMACTL_R     (*((volatile uint32_t *)0x4005F534))
#define GPIO_PORTH_SI_R         (*((volatile uint32_t *)0x4005F538))
#define GPIO_PORTH_DR12R_R      (*((volatile uint32_t *)0x4005F53C))
#define GPIO_PORTH_WAKEPEN_R    (*((volatile uint32_t *)0x4005F540))
#define GPIO_PORTH_WAKELVL_R    (*((volatile uint32_t *)0x4005F544))
#define GPIO_PORTH_WAKESTAT_R   (*((volatile uint32_t *)0x4005F548))
#define GPIO_PORTH_PP_R         (*((volatile uint32_t *)0x4005FFC0))
#define GPIO_PORTH_PC_R         (*((volatile uint32_t *)0x4005FFC4))

//*****************************************************************************
//
// GPIO registers (PORTJ AHB)
//
//*****************************************************************************
#define GPIO_PORTJ_DATA_BITS_R  ((volatile uint32_t *)0x40060000)
#define GPIO_PORTJ_DATA_R       (*((volatile uint32_t *)0x400603FC))
#define GPIO_PORTJ_DIR_R        (*((volatile uint32_t *)0x40060400))
#define GPIO_PORTJ_IS_R         (*((volatile uint32_t *)0x40060404))
#define GPIO_PORTJ_IBE_R        (*((volatile uint32_t *)0x40060408))
#define GPIO_PORTJ_IEV_R        (*((volatile uint32_t *)0x4006040C))
#define GPIO_PORTJ_IM_R         (*((volatile uint32_t *)0x40060410))
#define GPIO_PORTJ_RIS_R        (*((volatile uint32_t *)0x40060414))
#define GPIO_PORTJ_MIS_R        (*((volatile uint32_t *)0x40060418))
#define GPIO_PORTJ_ICR_R        (*((volatile uint32_t *)0x4006041C))
#define GPIO_PORTJ_AFSEL_R      (*((volatile uint32_t *)0x40060420))
#define GPIO_PORTJ_DR2R_R       (*((volatile uint32_t *)0x40060500))
#define GPIO_PORTJ_DR4R_R       (*((volatile uint32_t *)0x40060504))
#define GPIO_PORTJ_DR8R_R       (*((volatile uint32_t *)0x40060508))
#define GPIO_PORTJ_ODR_R        (*((volatile uint32_t *)0x4006050C))
#define GPIO_PORTJ_PUR_R        (*((volatile uint32_t *)0x40060510))
#define GPIO_PORTJ_PDR_R        (*((volatile uint32_t *)0x40060514))
#define GPIO_PORTJ_SLR_R        (*((volatile uint32_t *)0x40060518))
#define GPIO_PORTJ_DEN_R        (*((volatile uint32_t *)0x4006051C))
#define GPIO_PORTJ_LOCK_R       (*((volatile uint32_t *)0x40060520))
#define GPIO_PORTJ_CR_R         (*((volatile uint32_t *)0x40060524))
#define GPIO_PORTJ_AMSEL_R      (*((volatile uint32_t *)0x40060528))
#define GPIO_PORTJ_PCTL_R       (*((volatile uint32_t *)0x4006052C))
#define GPIO_PORTJ_ADCCTL_R     (*((volatile uint32_t *)0x40060530))
#define GPIO_PORTJ_DMACTL_R     (*((volatile uint32_t *)0x40060534))
#define GPIO_PORTJ_SI_R         (*((volatile uint32_t *)0x40060538))
#define GPIO_PORTJ_DR12R_R      (*((volatile uint32_t *)0x4006053C))
#define GPIO_PORTJ_WAKEPEN_R    (*((volatile uint32_t *)0x40060540))
#define GPIO_PORTJ_WAKELVL_R    (*((volatile uint32_t *)0x40060544))
#define GPIO_PORTJ_WAKESTAT_R   (*((volatile uint32_t *)0x40060548))
#define GPIO_PORTJ_PP_R         (*((volatile uint32_t *)0x40060FC0))
#define GPIO_PORTJ_PC_R         (*((volatile uint32_t *)0x40060FC4))

//*****************************************************************************
//
// GPIO registers (PORTK)
//
//*****************************************************************************
#define GPIO_PORTK_DATA_BITS_R  ((volatile uint32_t *)0x40061000)
#define GPIO_PORTK_DATA_R       (*((volatile uint32_t *)0x400613FC))
#define GPIO_PORTK_DIR_R        (*((volatile uint32_t *)0x40061400))
#define GPIO_PORTK_IS_R         (*((volatile uint32_t *)0x40061404))
#define GPIO_PORTK_IBE_R        (*((volatile uint32_t *)0x40061408))
#define GPIO_PORTK_IEV_R        (*((volatile uint32_t *)0x4006140C))
#define GPIO_PORTK_IM_R         (*((volatile uint32_t *)0x40061410))
#define GPIO_PORTK_RIS_R        (*((volatile uint32_t *)0x40061414))
#define GPIO_PORTK_MIS_R        (*((volatile uint32_t *)0x40061418))
#define GPIO_PORTK_ICR_R        (*((volatile uint32_t *)0x4006141C))
#define GPIO_PORTK_AFSEL_R      (*((volatile uint32_t *)0x40061420))
#define GPIO_PORTK_DR2R_R       (*((volatile uint32_t *)0x40061500))
#define GPIO_PORTK_DR4R_R       (*((volatile uint32_t *)0x40061504))
#define GPIO_PORTK_DR8R_R       (*((volatile uint32_t *)0x40061508))
#define GPIO_PORTK_ODR_R        (*((volatile uint32_t *)0x4006150C))
#define GPIO_PORTK_PUR_R        (*((volatile uint32_t *)0x40061510))
#define GPIO_PORTK_PDR_R        (*((volatile uint32_t *)0x40061514))
#define GPIO_PORTK_SLR_R        (*((volatile uint32_t *)0x40061518))
#define GPIO_PORTK_DEN_R        (*((volatile uint32_t *)0x4006151C))
#define GPIO_PORTK_LOCK_R       (*((volatile uint32_t *)0x40061520))
#define GPIO_PORTK_CR_R         (*((volatile uint32_t *)0x40061524))
#define GPIO_PORTK_AMSEL_R      (*((volatile uint32_t *)0x40061528))
#define GPIO_PORTK_PCTL_R       (*((volatile uint32_t *)0x4006152C))
#define GPIO_PORTK_ADCCTL_R     (*((volatile uint32_t *)0x40061530))
#define GPIO_PORTK_DMACTL_R     (*((volatile uint32_t *)0x40061534))
#define GPIO_PORTK_SI_R         (*((volatile uint32_t *)0x40061538))
#define GPIO_PORTK_DR12R_R      (*((volatile uint32_t *)0x4006153C))
#define GPIO_PORTK_WAKEPEN_R    (*((volatile uint32_t *)0x40061540))
#define GPIO_PORTK_WAKELVL_R    (*((volatile uint32_t *)0x40061544))
#define GPIO_PORTK_WAKESTAT_R   (*((volatile uint32_t *)0x40061548))
#define GPIO_PORTK_PP_R         (*((volatile uint32_t *)0x40061FC0))
#define GPIO_PORTK_PC_R         (*((volatile uint32_t *)0x40061FC4))

//*****************************************************************************
//
// GPIO registers (PORTL)
//
//*****************************************************************************
#define GPIO_PORTL_DATA_BITS_R  ((volatile uint32_t *)0x40062000)
#define GPIO_PORTL_DATA_R       (*((volatile uint32_t *)0x400623FC))
#define GPIO_PORTL_DIR_R        (*((volatile uint32_t *)0x40062400))
#define GPIO_PORTL_IS_R         (*((volatile uint32_t *)0x40062404))
#define GPIO_PORTL_IBE_R        (*((volatile uint32_t *)0x40062408))
#define GPIO_PORTL_IEV_R        (*((volatile uint32_t *)0x4006240C))
#define GPIO_PORTL_IM_R         (*((volatile uint32_t *)0x40062410))
#define GPIO_PORTL_RIS_R        (*((volatile uint32_t *)0x40062414))
#define GPIO_PORTL_MIS_R        (*((volatile uint32_t *)0x40062418))
#define GPIO_PORTL_ICR_R        (*((volatile uint32_t *)0x4006241C))
#define GPIO_PORTL_AFSEL_R      (*((volatile uint32_t *)0x40062420))
#define GPIO_PORTL_DR2R_R       (*((volatile uint32_t *)0x40062500))
#define GPIO_PORTL_DR4R_R       (*((volatile uint32_t *)0x40062504))
#define GPIO_PORTL_DR8R_R       (*((volatile uint32_t *)0x40062508))
#define GPIO_PORTL_ODR_R        (*((volatile uint32_t *)0x4006250C))
#define GPIO_PORTL_PUR_R        (*((volatile uint32_t *)0x40062510))
#define GPIO_PORTL_PDR_R        (*((volatile uint32_t *)0x40062514))
#define GPIO_PORTL_SLR_R        (*((volatile uint32_t *)0x40062518))
#define GPIO_PORTL_DEN_R        (*((volatile uint32_t *)0x4006251C))
#define GPIO_PORTL_LOCK_R       (*((volatile uint32_t *)0x40062520))
#define GPIO_PORTL_CR_R         (*((volatile uint32_t *)0x40062524))
#define GPIO_PORTL_AMSEL_R      (*((volatile uint32_t *)0x40062528))
#define GPIO_PORTL_PCTL_R       (*((volatile uint32_t *)0x4006252C))
#define GPIO_PORTL_ADCCTL_R     (*((volatile uint32_t *)0x40062530))
#define GPIO_PORTL_DMACTL_R     (*((volatile uint32_t *)0x40062534))
#define GPIO_PORTL_SI_R         (*((volatile uint32_t *)0x40062538))
#define GPIO_PORTL_DR12R_R      (*((volatile uint32_t *)0x4006253C))
#define GPIO_PORTL_WAKEPEN_R    (*((volatile uint32_t *)0x40062540))
#define GPIO_PORTL_WAKELVL_R    (*((volatile uint32_t *)0x40062544))
#define GPIO_PORTL_WAKESTAT_R   (*((volatile uint32_t *)0x40062548))
#define GPIO_PORTL_PP_R         (*((volatile uint32_t *)0x40062FC0))
#define GPIO_PORTL_PC_R         (*((volatile uint32_t *)0x40062FC4))

